### 1차 회의 (Kick-Off 미팅)
일시: 2024 . 04. 03
장소: 정보문화관 Q202
참석자: 김지송 김지우 박나영
의제 목록
의제 1 : 기존프로젝트의 develop VS  새로 개발할 것인지
의제 2 : 프로젝트의 주제는?
의제 3 : 프로젝트의 구성과 기능 
논의 내용 
기본적인 프로젝트 주제 선정을 위해 다양한 오픈소스프로젝트들을 서로 공유해보았다.  
[ 프로젝트 주제 의견 ]
위치기반한 근처 영화관 시간표 제공 서비스
경력과 진로를 고려하여 프로젝트 팀원 매칭 서비스 
생활습관과 성향을 고려한 룸메이트 매칭 서비스
요리 레시피 추천 시스템 (분명한 타겟층이 필요할것이라 생각됨.)
웹사이트 북마크 사이트 
캠핑장 예약관리 시스템 ex.야놀자
혈액량 실시간 정보 업데이트 사이트 
=> 명확한 주제 선정이 어려워 다양한 기능과 시스템을 아우를 수 있는 커뮤니티 (자취생 대상)을 구성하기로 함.
=> 선행 기술사례에서 다양한 커뮤니티를 주제를 분석하고 참고할 수 있을것이라고 판단해 다른 자취 커뮤니티를 바탕으로 디벨롭하기로 결정하였음. 
=> 자취생을 대상으로하는 커뮤니티를 구성하기 위해 반드시 필요한 필수 기능과 세부적으로 구현해야하는 기능, 아이디어를 설정해보았음.
우리조가 개발할 새로운 아이디어 
자취생들 만의 커뮤니티 개설
필수 구현 기능 
User Information : 회원가입, 로그인, 프로필, follower, following
알림기능 : 댓글, 팔로우 알림
게시판 글 작성 및 삭제
게시글 , 계정 검색 기능
게시판 목록 아이디어 
자취생들 만의 커뮤니티 개설
요리 관련 카테고리 (배달 쉐어 / 자취생의 1인 레시피)
익명 게시판
지역반경을 반영한 지역게시판 (ex. 당근마켓의 동네생활)
자취생활 정보 게시판
번개모임 게시판
기타 아이디어 
글을 올릴때 아이디 대신 [지역명 + 신분]  태그 부여 (ex. 중구 대학생)
근처 마트나 늦게까지 하는 약국과 병원 등의 정보 제공이 필요한가


차기 회의 일정
2024 . 04. 10  2차 회의


차기 회의 까지 고려사항 (피드백)
개발의 깊이(범위)를 고려해야함
자취생의 어떤 애로사항을 해결해줄 수 있는지 명확한 문제의식
기존 프로젝트와의 차별성을 둔 우리만의 독창성이 필요 
Git-hub상 라이센스 미기재시 사용불가(Open Source 정책 고려)



2차 회의 
일시: 2024 . 04. 10
장소: Webex 온라인 회의 
참석자: 김지우 김지송 박나영
의제 목록
의제 1 : 우리가 참고할 수 있는 라이센스가 있는 프로젝트 찾기 
의제 2 : 기존 프로젝트와 차별되는 우리프로젝트 만의 독창적인 기능
의제 3 : 프로젝트의 최종 구성과 기능 구현 방안 
논의 내용 
[ 의제 1 ] 
오픈소스 프로젝트는 조교님이 말한대로 라이센스를 어기고 무단 도용했을 경우, 오픈소스 정책에 어긋나 처벌을 받을 수 있기 때문에 저작권 문제에 대한 경각심을 갖고 라이센스가 표시된 레퍼런스만을 참고하는 것이 중요함!!
오픈 소스 프로젝트인만큼 참고할만한 프로젝트를 선정하기 위해 다양한 레퍼런스를 분석해본 결과 다음 레퍼런스들을 참고하여 우리만의 커뮤니티를 개발하기로 하였음. 
1인가구플랫폼 ‘둥지’ https://github.com/DoongG/DoongG-Client?tab=readme-ov-file
반려식물 관리 커뮤니티 ‘씨앗’ https://github.com/INFP-Study/CIAT?tab=readme-ov-file 

	[ 의제 2 ] 

기존 프로젝트들과 차별화 될만한 우리가 개발해야하는 기능은 무엇인가?
의견 1 : 커뮤니티 내 룸메이트 매칭 서비스 
의견 2: 주요시설 정보제공 서비스 
의견 3: 위치기반 쉐어 커뮤니티 서비스
자취인 전용 커뮤니티의 선행 연구 사례에서는 대부분 커뮤니티 기능에 치중하거나 공동구매 게시글을 올리는 정도에 그쳤음.
하지만 자취커뮤니티가 활성화 되기 위해서는 핵심기능인 “쉐어 기능”이 상용화 되어야한다고 판단.
쉐어 기능이 상용화 되기 위해서는 위치 기반의 쉐어게시물 공유기능이 필요.
쉐어하는 품목이 많아지면 그에 따른 이용자 수도 증가할 것
지도상으로 쉐어하는 게시글을 볼 수 있다면 쉐어하는 것을 고려하는데 큰 부담(위치고려 등)이 줄어들 것 -> 자취커뮤니티의 상용화 

	[ 의제 3 ]

우리가 구현하기로한 최종 자취 커뮤니티 프로젝트의 구성과 구현 방안은 ? 
최종 설계 결과물의 기본적인 틀 구성
커뮤니티 기능( 쉐어 / 일반)
사용자 기능(회원가입 및 로그인 / 프로필 관리 / 알림설정 / 활동내역 확인)
관리자 기능 (게시글 관리 / 댓글 관리 / 사용자 관리)
위치 기반 시각화 화면 제공
주변 쉐어 게시글 목록 표시
사용자 위치 파악 기능
위치 검색 및 필터링 기능
목표 설계를 위한 구현계획
카카오맵 API를 활용한 지도 형태 시각화 제공
사용자의 글을 지도 상으로 띄우면서 직관적으로 지도 위 주변 쉐어글을 볼 수 있도록 함. 
커뮤니티를 일반 과 쉐어 로 나누어 구분
웹개발 VS 앱개발 
앱개발은 각 운영체제에 맞는 언어를 사용해야한다는 불편함과 별도의 앱개발 시간 소요가 크다고 판단되어 웹개발로 진행.
웹개발로 진행됨에 따른 반응형 웹사이트, 사용자의 유연한 접속을 유도하는 개발코드 작성 등을 유의해야함. 



차기 회의 일정
2024 . 04. 15  3차 회의


차기 회의 까지 준비사항/고려사항 
수행계획서 본인 파트 작성 
설계의 현실적 제한요소 찾아오기
예비 발표 후 피드백 수정 





3차 회의 
일시: 2024 . 04. 15
장소: 정보문화관 P404 
참석자: 김지우 김지송 박나영
의제 목록
의제 1 : 커뮤니티의 이름 정하기  
의제 2 : 설계의 현실적 제한 요소 
의제 3 : 예비 발표 피드백 반영한 전체적인 수정 회의 
논의 내용 
[ 의제 1 ]
자취하는 사람들의 소통의 의미를 담으면서도 우리의 독창적인 기능(위치기반 쉐어)을 나타낼 수 있는 뜻의 이름을 정하고자함.
하지만 우리의 독창적 기능까지 고려하면서 입에 붙는 단어가 생각나지 않았음
주요 의견들 ( 립 밤 / 삐약 / 커뮤니티플랫폼 줄여서 커플 / 립서비스 )
최종 결정된 이름 
리본 (LIVE:ON)
비록 다들 떨어져 혼자 살고 있지만 리본으로 묶여있는 것처럼 느낄 수 있도록 친근하고 따뜻한 커뮤니티라는 의미
[ 의제 2 ] : 설계의 현실적 제한요소에 대한 의견 취합
가장 큰 제한적 요소로는 아직 아무도 프로젝트 개발을 해보지 못했다는 점
웹 프로젝트로 진행하기 때문에 사용자 기기의 하드웨어 기능에 의존하지 않도록 개발해야한다. 
웹으로 설계할 경우 앱에 비해 인터넷 의존도가 높기 때문에 사용자의 원만한 인터넷 환경이 요구될 것이다. 
닉네임제로 운영하더라도 게시글과 지역 태그 등을 통해 특정인을 구분할 수 있으며, 개인 프라이버시가 침해될 수 있다는 우려가 크다. 
위치별 쉐어 게시글 띄우기 기능의 악용 가능성이 존재한다. 따라서 쉐어글의 명확한 위치를 표시하지 않는 대신 반경 약 700m 기준의 반원으로 표시하는 대안으로 사용자의 거주지 보호에 힘써야한다. 


[ 의제 3 ] : 예비 발표에 대한 피드백 반영
가장 중요한것은 우려사항 ( 개인 프라이버시와 개인정보 노출 문제 악용)
의제 2의 의견처럼 쉐어글의 위치를 불명확하게 표시하기
(필수 구현)가입시 개인정보 동의와 위치기반 제공 동의서를 상세하게 작성하고 모든 사용자에게 강조 
당근 마켓 어플을 중요 선행 사례로 참고하는 것도 좋은 방안이 될듯 
커뮤니티의 이용대상자가 전국으로 너무 확대되어 있는 경향이 있다
 카카오 API를 사용했을 때 전국으로 확대 혹은 수도권으로 축소의 차이가 크진 않을 것으로 예상되지만, 아직 개발을 시작한 것은 아니기 때문에 ‘서울 자취인’으로 대상을 축소하고 여건이 된다면 범위를 넓혀나가는 방안으로 추진. 


차기 회의 일정
2024 . 04. 22  4차 회의


차기 회의 까지 준비사항/고려사항 
수행계획서에 따른 개발 준비 및 공부 

