## 질의사항 답변 작성 

### Q1.유사한 프로젝트에서 우려되었던 점이 사용자가 실제로 이 서비스를 이용할 지인데 이에 대한 선행조사가 되었는가?    
        -

### Q2. 배달에 대한걸 웹 내부에서 진행되는 것인가?    
        : 웹 내부에서 배달을 직접 이용할 수 있게 해주는 것이 아니라 배달을 같이 이용할 사람들을 구할 수 있게 해주는 서비스이다. 사용자별로 선호하는 배달앱이나 결제방식 등이 다양하기 때문에, 우리는 같이 배달을 이용할 사람들을 찾을 수 있게 해주고, 그 사람들 간 채팅기능을 통해 메뉴나 결제 방식을 결정할 수 있게 해준다.
### Q3. 모르는 사람과의 쉐어의 경우 안정성의 문제가 있지 않나?
        : 쉐어글이 지도로 표시되는 특성상 이용자의 안전 및 신변이 위협될 경우를 인지하여, 쉐어글을 지도로 표시할때 700m 지름의 반원으로 표시하여 위치를 불분명하게 나타내기로 하였다. 또한 다른 게시글은 제외하고 오로지 쉐어글만 지도에 노출되게 하여 이용자의 특정 우려를 최소화 하였고, 쉐어글을 올렸을때 무조건 쉐어하도록 설계되는 것이 아닌 채팅방을 개설하여 같이 쉐어 최종결정의 유무와 만날 장소, 결제 방법등을 이용자가 결정할 수 있게끔 설계하였다.
